app/views/groups/index.html.erb

		<td><%= link_to group.description, group %></td>
		<td><%= User.find(group.owner_id).email %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1