app/views/groups/show.html.erb


		<% if @group.users.include?(current_user) %>
---
SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users".id = "groups_users".user_id WHERE ("groups_users".group_id = 1 ) AND (id <> 1)

			<%else%>
			<%= User.find(@group.owner_id).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

				<tr>
					<td><%= User.find(transaction.user_id).email %></td>
---
SELECT 1 FROM "users" INNER JOIN "groups_users" ON "users".id = "groups_users".user_id WHERE "users"."id" = 2 AND ("groups_users".group_id = 1 ) LIMIT 1