app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "transactions" WHERE ("transactions".user_id = 1)
---
    <span class="transactions">
      You have <%= pluralize(current_user.transactions.count, "transaction") %>