app/controllers/alerts_controller.rb

  def show
    @alert = Alert.find(params[:id])
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = 1 LIMIT 1

  def edit
    @alert = Alert.find(params[:id])
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = 2 LIMIT 1

  def create
    @alert = Alert.new(params[:alert])

    respond_to do |format|
      if @alert.save
---
INSERT INTO "alerts" ("title", "amount", "date", "created_at", "updated_at", "user_id") VALUES ('Pay Phone', 300.0, '2011-11-28', '2011-11-28 07:21:58.309124', '2011-11-28 07:21:58.309124', NULL)

  def update
    @alert = Alert.find(params[:id])

    respond_to do |format|
      if @alert.update_attributes(params[:alert])
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = 4 LIMIT 1
UPDATE "alerts" SET "amount" = 100.0, "updated_at" = '2011-11-28 20:22:18.504264' WHERE "alerts"."id" = 4

  def destroy
    @alert = Alert.find(params[:id])
    @alert.destroy
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = 4 LIMIT 1
DELETE FROM "alerts" WHERE "alerts"."id" = 4