app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."owner_id" = 1
---
  def mygroups
    @groups = Group.find(:all, :conditions => {:owner_id => current_user.id})

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
SELECT 1 FROM "users" INNER JOIN "groups_users" ON "users".id = "groups_users".user_id WHERE "users"."id" = 2 AND ("groups_users".group_id = 1 ) LIMIT 1
---
  def show
    @group = Group.find(params[:id])

    if params[:leave]
      if @group.users.include?(current_user)

SELECT "transactions".* FROM "transactions" WHERE ("transactions".user_id = 2) ORDER BY transactions.date DESC
SELECT "transactions".* FROM "transactions" ORDER BY transactions.date DESC
SELECT SUM("transactions"."amount") AS sum_id FROM "transactions" WHERE ("transactions".user_id = 1)
---

    @total = 0

    @transactions = User.find(@group.owner_id).transactions
    @members.each do |m|
      temp = m.transactions.dup
     @total += temp.sum('amount')

INSERT INTO "groups" ("name", "description", "owner_id", "created_at", "updated_at") VALUES ('MS22', 'adsfasdf', 1, '2011-11-23 17:49:51.065304', '2011-11-23 17:49:51.065304')
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 4 LIMIT 1
---
  def update
    @group = Group.find(params[:id])