app/controllers/pages_controller.rb

  def home
    @title = "Home"
    if user_signed_in?
      @feed_items = current_user.feed.paginate(:page => params[:page])
      alerts = current_user.alerts

      if alerts
        alerts.each do |a|
---
SELECT "alerts".* FROM "alerts" WHERE ("alerts".user_id = 1) AND (date <= '2011-11-28')