app/controllers/transactions_controller.rb

  def index

    @transactions = current_user.transactions(:order => "date DESC")

    @sub_title = "Showing all your expenses"

    if params[:search]
      @transactions = @transactions.scoped(:conditions => ['description LIKE ? OR tag LIKE ? OR location LIKE ?', "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%"])
    @sub_title = "Found "
    @sub_title << @transactions.size.to_s
    @sub_title << " results matching with - '"
    @sub_title << params[:search]
    @sub_title << "'"
    end

    @total = @transactions.sum('amount')
---
SELECT "transactions".* FROM "transactions" WHERE ("transactions".user_id = 1) ORDER BY transactions.date DESC
SELECT COUNT(*) FROM "transactions" WHERE ("transactions".user_id = 1) AND (description LIKE '%Food%' OR tag LIKE '%Food%' OR location LIKE '%Food%')
SELECT SUM("transactions"."amount") AS sum_id FROM "transactions" WHERE ("transactions".user_id = 1) AND (tag = 'Gadgets')

  def show
    @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = 1 ORDER BY transactions.date DESC LIMIT 1

  def new
    @transaction = Transaction.new

    @transactions = current_user.transactions
    #Code below is for calculating information for the Pie chart
    @tag_set = Set.new

    @transactions.each do |tran|
---
SELECT "transactions".* FROM "transactions" WHERE ("transactions".user_id = 2) ORDER BY transactions.date DESC

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = 6 ORDER BY transactions.date DESC LIMIT 1

  def create

    @transaction  = current_user.transactions.build(params[:transaction])

    #@transaction = Transaction.new(params[:transaction])

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("user_id", "amount", "date", "location", "description", "tag", "created_at", "updated_at") VALUES (2, 100.0, '2011-11-24', 'PA', 'Samsung', 'Mobile', '2011-11-24 00:12:03.467031', '2011-11-24 00:12:03.467031')

  def update
    @transaction = Transaction.find(params[:id])

    respond_to do |format|
      if @transaction.update_attributes(params[:transaction])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = 7 ORDER BY transactions.date DESC LIMIT 1
UPDATE "transactions" SET "location" = 'PA', "tag" = 'Gadgets', "updated_at" = '2011-11-28 04:17:29.145402' WHERE "transactions"."id" = 8

  def destroy
    @transaction = Transaction.find(params[:id])
    @transaction.destroy
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = 1 ORDER BY transactions.date DESC LIMIT 1
DELETE FROM "transactions" WHERE "transactions"."id" = 9